package lesson_29;

/**
 * @author Sergey Bugaenko
 * {@code @date} 26.05.2025
 */

public class Quiz {

    /*
    С помощью какого механизма можно избежать дублирование кода в двух разных классах?
    - Наследование

    С помощью какого ключевого слова мы наследуемся?
    - extends

    A extends B - где предок, где потомок
    A - потомок (ребенок)
    B - предок

    С помощью какого модификатора можно сделать так, чтобы метод или поле были доступны в потомке
    - public
    - protected

    Какие элементы класса-предка (родителя) условно-копируются в класс-потомок?
    - поля
    - методы
    - НЕ копируются конструкторы


    Как принудительно вызвать конструктор предка в конструкторе потомка?
    - super()

    Что будет, если в конструкторе потомка не вызвать явно конструктор предка?
    - Java попытается вызвать пустой конструктор предка (super())
    - А если такого конструктора нет - будет ошибка компиляции - программа не запустится.

     */

}
